## 문제 1. 
- 다음은 California Housing 데이터 세트이다. 데이터 중 결측치가 있는 경우 해당 데이터의 행을 모두 제거하고, 첫번째 행부터 순서대로 70%까지의 데이터를 훈련 데이터로 추출한 데이터 세트를 구성한다. 변수 중 'housing_media_age'의 Q1(제 1사분위수) 값을 정수로 계산하시오.

In [1]:
import pandas as pd 
import numpy as np

df = pd.read_csv("data/3회/301_housing.csv")
df.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [2]:
df.isnull().sum()

longitude               0
latitude                0
housing_median_age      0
total_rooms             0
total_bedrooms        207
population              0
households              0
median_income           0
median_house_value      0
ocean_proximity         0
dtype: int64

In [5]:
df = df.dropna()
df.isnull().sum()

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
ocean_proximity       0
dtype: int64

In [30]:
len(df)

20433

In [29]:
df.index[-1]

20639

In [28]:
location = int(0.7*len(df))
train = df.iloc[:location]
train

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY
...,...,...,...,...,...,...,...,...,...,...
14582,-117.18,32.84,31.0,3064.0,575.0,1476.0,549.0,3.6667,175900.0,NEAR OCEAN
14583,-117.18,32.84,30.0,2290.0,523.0,1272.0,472.0,3.5606,165100.0,NEAR OCEAN
14584,-117.18,32.84,32.0,1351.0,237.0,823.0,269.0,4.2768,167800.0,NEAR OCEAN
14585,-117.19,32.84,30.0,2492.0,406.0,1250.0,431.0,5.5277,197100.0,NEAR OCEAN
14586,-117.19,32.84,35.0,2263.0,427.0,1001.0,408.0,3.8750,172000.0,NEAR OCEAN

In [25]:
int(train['housing_median_age'].quantile(0.25))

19

## 문제 2. 
- 다음은 국가별 연도별 인구 10만 명당 결핵 유병률 데이터 세트이다. 2000년도의 국가별 결핵 유병률 데이터 세트에서 2000년도의 평균값보다 더 큰 유병률 값을 가진 국가의 수를 계산하시오.

### 풀이1

In [31]:
import numpy as np
import pandas as pd 

df = pd.read_csv("data/3회/302_worlddata.csv")
df.head()

,year,Afghanistan,Albania,Algeria,Andorra,Angola,Antigua & Barbuda,Argentina,Armenia,Australia,...,Tanzania,USA,Uruguay,Uzbekistan,Vanuatu,Venezuela,Vietnam,Yemen,Zambia,Zimbabwe
0,1999,0,89.0,25.0,245.0,217.0,102.0,193.0,21.0,261.0,...,36.0,249.0,115.0,25.0,21.0,333.0,111,6.0,32.0,64.0
1,2000,0,132.0,0.0,138.0,57.0,128.0,25.0,179.0,72.0,...,6.0,158.0,35.0,101.0,18.0,100.0,2,0.0,19.0,18.0
2,2001,0,54.0,14.0,312.0,45.0,45.0,221.0,11.0,212.0,...,1.0,84.0,220.0,8.0,11.0,3.0,1,0.0,4.0,4.0
3,2002,0,4.9,0.7,12.4,5.9,4.9,8.3,3.8,10.4,...,5.7,8.7,6.6,2.4,0.9,7.7,2,0.1,2.5,4.7

In [46]:
df_2000 = df[df['year'] == 2000]
df_2000

,year,Afghanistan,Albania,Algeria,Andorra,Angola,Antigua & Barbuda,Argentina,Armenia,Australia,...,Tanzania,USA,Uruguay,Uzbekistan,Vanuatu,Venezuela,Vietnam,Yemen,Zambia,Zimbabwe
1,2000,0,132.0,0.0,138.0,57.0,128.0,25.0,179.0,72.0,...,6.0,158.0,35.0,101.0,18.0,100.0,2,0.0,19.0,18.0

In [86]:
mean_2000 = float(df_2000.drop(columns=['year']).mean(axis=1))
print(mean_2000)

81.01036269430051

In [140]:
country_count = int(len(df_2000.drop(columns=['year']).columns) - df_2000[df_2000 > mean_2000].isnull().sum(axis=1))
print(f'국가의 수 : {country_count}')

국가의 수 : 76

In [139]:
len(df_2000.drop(columns=['year']).columns) - df_2000[df_2000 > mean_2000].isnull().sum(axis=1)

1    76
dtype: int64

### 풀이2

In [160]:
df_2000 = df[df['year']==2000].T.drop('year')
df_2000.columns = ['value']
df_2000

             value
Afghanistan    0.0
Albania      132.0
Algeria        0.0
Andorra      138.0
Angola        57.0
...            ...
Venezuela    100.0
Vietnam        2.0
Yemen          0.0
Zambia        19.0
Zimbabwe      18.0

[193 rows x 1 columns]

In [161]:
mean = float(df_2000.mean())
print(mean)

81.01036269430051

In [163]:
country_count = len(df_2000[df_2000['value'] > mean])
print(f'국가의 수 : {country_count}')

국가의 수 : 76

## 문제 3
- 다음은 Titanic 데이터 세트이다. 주어진 데이터 세트의 컬럼 중 빈 값 또는 결측치를 확인하여 결측치의 비율이 가장 높은 변수명을 출력하시오.

In [164]:
import pandas as pd 
import numpy as np 

df = pd.read_csv("data/3회/303_titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C123,S

### 풀이1

In [185]:
null_df = pd.DataFrame(df.isnull().sum())
null_df.columns = ['value']
null_df

             value
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          118
Embarked         2

In [216]:
null_df.sort_values(by='value', ascending=False).index[0]

'Age'

### 풀이2

In [205]:
ratio = df.isnull().sum() / df.count()
ratio

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.247899
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.152652
Embarked       0.002250
dtype: float64

In [211]:
ratio.sort_values(ascending=False).index[0]

'Age'